jamesmunns/kinetis-rs/platform/hal/mpu/fsl_mpu_hal.h
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef __FSL_MPU_HAL_H__
#define __FSL_MPU_HAL_H__

#include <assert.h>
#include <stdint.h>
#include <stdbool.h>
#include "fsl_mpu_features.h"
#include "fsl_device_registers.h"

#define MPU_REGION_NUMBER 12

/*!
 * @addtogroup mpu_hal
 * @{
 */

/*******************************************************************************
 * Definitions
 *******************************************************************************/

/*! @brief MPU region number region0~region11. */
typedef enum _mpu_region_num{
    kMPURegionNum00 = 0U,  /*!< MPU region number 0*/
    kMPURegionNum01 = 1U,  /*!< MPU region number 1*/
    kMPURegionNum02 = 2U,  /*!< MPU region number 2*/
    kMPURegionNum03 = 3U,  /*!< MPU region number 3*/
    kMPURegionNum04 = 4U,  /*!< MPU region number 4*/
    kMPURegionNum05 = 5U,  /*!< MPU region number 5*/
    kMPURegionNum06 = 6U,  /*!< MPU region number 6*/
    kMPURegionNum07 = 7U,  /*!< MPU region number 7*/
    kMPURegionNum08 = 8U,  /*!< MPU region number 8*/
    kMPURegionNum09 = 9U,  /*!< MPU region number 9*/
    kMPURegionNum10 = 10U, /*!< MPU region number 10*/
    kMPURegionNum11 = 11U, /*!< MPU region number 11*/
#if defined(CPU_MK70FN1M0VMF12) || defined(CPU_MK70FX512VMF12) || defined(CPU_MK70FN1M0VMF15) || defined(CPU_MK70FX512VMF15) || \
    defined(CPU_MK70FN1M0VMJ12) || defined(CPU_MK70FX512VMJ12) || defined(CPU_MK70FN1M0VMJ15) || defined(CPU_MK70FX512VMJ15)
    kMPURegionNum11 = 12U, /*!< MPU region number 12*/
    kMPURegionNum11 = 13U, /*!< MPU region number 13*/
    kMPURegionNum11 = 14U, /*!< MPU region number 14*/
    kMPURegionNum11 = 15U, /*!< MPU region number 15*/
#endif
}mpu_region_num;

/*! @brief MPU error address register0~4. */
typedef enum _mpu_error_addr_reg{
    kMPUErrorAddrReg00 = 0U, /*!< MPU error address register 0*/
    kMPUErrorAddrReg01 = 1U, /*!< MPU error address register 1*/
    kMPUErrorAddrReg02 = 2U, /*!< MPU error address register 2*/
    kMPUErrorAddrReg03 = 3U, /*!< MPU error address register 3*/
    kMPUErrorAddrReg04 = 4U  /*!< MPU error address register 4*/
}mpu_error_addr_reg;

/*! @brief MPU error detail register0~4. */
typedef enum _mpu_error_detail_reg{
    kMPUErrorDetailReg00 = 0U, /*!< MPU error detail register 0*/
    kMPUErrorDetailReg01 = 1U, /*!< MPU error detail register 1*/
    kMPUErrorDetailReg02 = 2U, /*!< MPU error detail register 2*/
    kMPUErrorDetailReg03 = 3U, /*!< MPU error detail register 3*/
    kMPUErrorDetailReg04 = 4U  /*!< MPU error detail register 4*/
}mpu_error_detail_reg;

/*! @brief MPU access error. */
typedef enum _mpu_error_access_type{
    kMPUReadErrorType  = 0U, /*!< MPU error type---read*/
    kMPUWriteErrorType = 1U  /*!< MPU error type---write*/
}mpu_error_access_type;

/*! @brief MPU access error attributes.*/
typedef enum _mpu_error_attributes{
    kMPUUserModeInstructionAccess       = 0U, /*!< access instruction error in user mode*/
    kMPUUserModeDataAccess              = 1U, /*!< access data error in user mode*/
    kMPUSupervisorModeInstructionAccess = 2U, /*!< access instruction error in supervisor mode*/
    kMPUSupervisorModeDataAccess        = 3U  /*!< access data error in supervisor mode*/
}mpu_error_attributes;

/*! @brief access MPU in which mode. */
typedef enum _mpu_access_mode{
    kMPUAccessInUserMode       = 0U, /*!< access data or instruction in user mode*/
    kMPUAccessInSupervisorMode = 1U  /*!< access data or instruction in supervisor mode*/
}mpu_access_mode;

/*! @brief MPU master number. */
typedef enum _mpu_master_num{
    kMPUMaster00 = 0U, /*!< Core.*/
    kMPUMaster01 = 1U, /*!< Debugger.*/
    kMPUMaster02 = 2U, /*!< DMA.*/
    kMPUMaster03 = 3U, /*!< ENET.*/
    kMPUMaster04 = 4U, /*!< USB.*/
    kMPUMaster05 = 5U, /*!< SDHC.*/
    kMPUMaster06 = 6U, /*!< undefined.*/
    kMPUMaster07 = 7U  /*!< undefined.*/
}mpu_master_num;

/*! @brief MPU error access control detail. */
typedef enum _mpu_error_access_control{
    kMPUNoRegionHitError        = 0U, /*!< no region hit error*/
    kMPUNoneOverlappRegionError = 1U, /*!< access single region error*/
    kMPUOverlappRegionError     = 2U  /*!< access overlapping region error*/
}mpu_error_access_control;

/*! @brief MPU access rights in supervisor mode for master0~master3. */
typedef enum _mpu_supervisor_access_rights{
    kMPUSupervisorReadWriteExecute = 0U, /*!< R W E allowed in supervisor mode*/
    kMPUSupervisorReadExecute      = 1U, /*!< R E allowed in supervisor mode*/
    kMPUSupervisorReadWrite        = 2U, /*!< R W allowed in supervisor mode*/
    kMPUSupervisorEqualToUsermode  = 3U  /*!< access permission equal to user mode*/
}mpu_supervisor_access_rights;

/*! @brief MPU access rights in user mode for master0~master3. */
typedef enum _mpu_user_access_rights{
    kMPUUserNoAccessRights   = 0U, /*!< no access allowed in user mode*/
    kMPUUserExecute          = 1U, /*!< E allowed in user mode*/
    kMPUUserWrite            = 2U, /*!< W allowed in user mode*/
    kMPUUserWriteExecute     = 3U, /*!< W E allowed in user mode*/
    kMPUUserRead             = 4U, /*!< R allowed in user mode*/
    kMPUUserReadExecute      = 5U, /*!< R E allowed in user mode*/
    kMPUUserReadWrite        = 6U, /*!< R W allowed in user mode*/
    kMPUUserReadWriteExecute = 7U  /*!< R W E allowed in user mode*/
}mpu_user_access_rights;

