jamesmunns/kinetis-rs/platform/hal/mpu/fsl_mpu_hal.h
/*! @brief MPU process identifier. */
typedef enum _mpu_process_identifier_value{
    kMPUIdentifierDisable = 0U, /*!< processor identifier disable*/
    kMPUIdentifierEnable  = 1U  /*!< processor identifier enable*/
}mpu_process_identifier_value;

/*! @brief MPU access control for master4~master7. */
typedef enum _mpu_access_control{
    kMPUAccessDisable = 0U, /*!< Read or Write not allowed*/
    kMPUAccessEnable  = 1U  /*!< Read or Write allowed*/
}mpu_access_control;

/*! @brief MPU access type for master4~master7. */
typedef enum _mpu_access_type{
    kMPUAccessRead  = 0U, /*!< Access type is read*/
    kMPUAccessWrite = 1U  /*!< Access type is write*/
}mpu_access_type;

/*! @brief MPU access region valid. */
typedef enum _mpu_region_valid{
    kMPURegionInvalid = 0U, /*!< region invalid*/
    kMPURegionValid   = 1U  /*!< region valid*/
}mpu_region_valid;

/*! @brief MPU status return codes.*/
typedef enum _MPU_status {
    kStatus_MPU_Success                   = 0x0U, /*!< Succeed. */
    kStatus_MPU_NotInitlialized           = 0x1U, /*!< MPU is not initialized yet. */
    kStatus_MPU_NullArgument              = 0x2U, /*!< Argument is NULL.*/
 } mpu_status_t;
 
/*******************************************************************************
 ** Variables
 *******************************************************************************/

/*******************************************************************************
 * API
 *******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name MPU HAL.
 * @{
 */

/*!
 * @brief Enables the MPU module operation
 *
 * @param baseAddr The MPU peripheral base address
 */
static inline void MPU_HAL_Enable(uint32_t baseAddr)
{
    BW_MPU_CESR_VLD(baseAddr, (uint8_t)true);
}

/*!
 * @brief Disables the MPU module operation
 *
 * @param baseAddr The MPU peripheral base address
 */
static inline void MPU_HAL_Disable(uint32_t baseAddr)
{
    BW_MPU_CESR_VLD(baseAddr, (uint8_t)false);
}

/*!
 * @brief Checks whether the MPU module is enabled
 *
 * @param baseAddr The MPU peripheral base address
 * @retval true MPU module is enabled
 * @retval false MPU module is disabled
 */
static inline bool MPU_HAL_IsEnabled(uint32_t baseAddr)
{
   return BR_MPU_CESR_VLD(baseAddr);
}

/*!
 * @brief Returns the total region number
 *
 * @param baseAddr The MPU peripheral base address
 * @retval the number of regions
 */
static inline uint32_t MPU_HAL_GetNumberOfRegions(uint32_t baseAddr)
{
    return (BR_MPU_CESR_NRGD(baseAddr));
}

/*!
 * @brief Returns MPU slave sports
 *
 * @param baseAddr The MPU peripheral base address
 * @retval the number of slaves
 */
static inline uint32_t MPU_HAL_GetNumberOfSlaves(uint32_t baseAddr)
{
    return (BR_MPU_CESR_NSP(baseAddr));
}

/*!
 * @brief Returns hardware level info
 *
 * @param baseAddr The MPU peripheral base address
 * @retval hardware revision level
 */
static inline uint32_t MPU_HAL_GetHardwareRevisionLevel(uint32_t baseAddr)
{
    return (BR_MPU_CESR_HRL(baseAddr));
}

/*!
 * @brief Returns hardware level info
 *
 * @param baseAddr The MPU peripheral base address
 * @param regNum Error address register number
 * @retval error access address
 */
static inline uint32_t MPU_HAL_GetErrorAccessAddr(uint32_t baseAddr, mpu_error_addr_reg regNum)
{
    assert(regNum < HW_MPU_EARn_COUNT);
    return (BR_MPU_EARn_EADDR(baseAddr, regNum));
}

/*!
 * @brief Returns error access slaves sports
 *
 * @param baseAddr The MPU peripheral base address
 * @retval error slave sports
*/
static inline uint8_t MPU_HAL_GetErrorSlaveSports(uint32_t baseAddr)
{
    return (BR_MPU_CESR_SPERR(baseAddr));
}

/*!
 * @brief Returns error access address
 *
 * @param baseAddr The MPU peripheral base address
 * @param errorDetailRegNum Error detail register number
 * @retval error access type
*/
static inline mpu_error_access_type MPU_HAL_GetErrorAccessType(uint32_t baseAddr, mpu_error_detail_reg errorDetailRegNum)
{
    assert(errorDetailRegNum < HW_MPU_EDRn_COUNT);
    return (mpu_error_access_type)(BR_MPU_EDRn_ERW(baseAddr, errorDetailRegNum));
}

/*!
 * @brief Returns error access attributes
 *
 * @param baseAddr The MPU peripheral base address
 * @param errorDetailRegNum Detail error register number
 * @retval error access attributes
 */
static inline mpu_error_attributes MPU_HAL_GetErrorAttributes(uint32_t baseAddr, mpu_error_detail_reg errorDetailRegNum)
{
    assert(errorDetailRegNum < HW_MPU_EDRn_COUNT);
    return (mpu_error_attributes)(BR_MPU_EDRn_EATTR(baseAddr, errorDetailRegNum));
}

/*!
 * @brief Returns error access master number
 *
 * @param baseAddr The MPU peripheral base address
 * @param errorDetailRegNum Error register number
 * @retval error master number
 */
static inline mpu_master_num MPU_HAL_GetErrorMasterNum(uint32_t baseAddr, mpu_error_detail_reg errorDetailRegNum)
{
    assert(errorDetailRegNum < HW_MPU_EDRn_COUNT);
    return (mpu_master_num)(BR_MPU_EDRn_EMN(baseAddr, errorDetailRegNum));
}

/*!
 * @brief Returns error process identifier
 *
 * @param baseAddr The MPU peripheral base address
 * @param errorDetailRegNum Error register number
 * @retval error process identifier
 */
static inline uint32_t MPU_HAL_GetErrorProcessIdentifier(uint32_t baseAddr, mpu_error_detail_reg errorDetailRegNum)
{
    assert(errorDetailRegNum < HW_MPU_EDRn_COUNT);
    return(BR_MPU_EDRn_EPID(baseAddr, errorDetailRegNum));
}

/*!
 * @brief Returns error access control
 *
 * @param baseAddr The MPU peripheral base address
 * @param errorDetailRegNum Error register number
 * @retval error access control
 */
static inline mpu_error_access_control MPU_HAL_GetErrorAccessControl(uint32_t baseAddr, mpu_error_detail_reg errorDetailRegNum)
{
    assert(errorDetailRegNum < HW_MPU_EDRn_COUNT);
    
    uint32_t i = BR_MPU_EDRn_EACD(baseAddr, errorDetailRegNum);
    
