jamesmunns/kinetis-rs/platform/hal/mpu/fsl_mpu_hal.h
    if(0 == i)
    {
        return (kMPUNoRegionHitError);
    }
    else if(!(i&(i-1)))
    {
        return (kMPUNoneOverlappRegionError);
    }
    else 
    {
        return (kMPUOverlappRegionError);
    }
}

/*!
 * @brief Returns the region start address
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval region start address
 */
static inline uint32_t MPU_HAL_GetRegionStartAddr(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD0_COUNT);
    return (BR_MPU_RGDn_WORD0_SRTADDR(baseAddr, regionNum)<<BP_MPU_RGDn_WORD0_SRTADDR);
}

/*!
 * @brief Sets region start address
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param startAddr Region start address
 */
static inline void MPU_HAL_SetRegionStartAddr(uint32_t baseAddr, mpu_region_num regionNum, uint32_t startAddr)
{
    assert(regionNum < HW_MPU_RGDn_WORD0_COUNT);
    startAddr >>= BP_MPU_RGDn_WORD0_SRTADDR; 
    BW_MPU_RGDn_WORD0_SRTADDR(baseAddr, regionNum, startAddr);
}

/*!
 * @brief Returns region end address
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval region end address
 */
static inline uint32_t MPU_HAL_GetRegionEndAddr(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD1_COUNT);
    return (BR_MPU_RGDn_WORD1_ENDADDR(baseAddr, regionNum)<<BP_MPU_RGDn_WORD0_SRTADDR);
}

/*!
 * @brief Sets region end address
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param endAddr Region end address
 */
static inline void MPU_HAL_SetRegionEndAddr(uint32_t baseAddr, mpu_region_num regionNum, uint32_t endAddr)
{
    assert(regionNum < HW_MPU_RGDn_WORD1_COUNT);
    endAddr >>= BP_MPU_RGDn_WORD0_SRTADDR;
    BW_MPU_RGDn_WORD1_ENDADDR(baseAddr, regionNum, endAddr);
}

/*!
 * @brief Returns all masters access permission for a specific region
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval all masters access permission
 */
static inline uint32_t MPU_HAL_GetAllMastersAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (HW_MPU_RGDn_WORD2_RD(baseAddr, regionNum));
}

/*!
 * @brief Sets all masters access permission for a specific region
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights All masters access rights
 */
static inline void MPU_HAL_SetAllMastersAccessRights(uint32_t baseAddr, mpu_region_num regionNum, uint32_t accessRights)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    HW_MPU_RGDn_WORD2_WR(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Gets M0 access permission in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master0 access permission
 */
static inline mpu_supervisor_access_rights MPU_HAL_GetM0SupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (mpu_supervisor_access_rights)(BR_MPU_RGDn_WORD2_M0SM(baseAddr, regionNum)); 
}

/*!
 * @brief Gets M0 access permission in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master0 access permission
 */
static inline mpu_user_access_rights MPU_HAL_GetM0UserAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT); 
    return (mpu_user_access_rights)(BR_MPU_RGDn_WORD2_M0UM(baseAddr, regionNum));
}

/*!
 * @brief Sets M0 access permission in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master0 access permission
 */
static inline void MPU_HAL_SetM0SupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_supervisor_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);  
    BW_MPU_RGDn_WORD2_M0SM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Sets M0 access permission in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master0 access permission
 */
static inline void MPU_HAL_SetM0UserAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_user_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT); 
    BW_MPU_RGDn_WORD2_M0UM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Checks whether the M0 process identifier is enabled in region hit evaluation
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval true m0 process identifier is enabled
 * @retval false m0 process identifier is disabled
 */

static inline bool MPU_HAL_IsM0ProcessIdentifierEnabled(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (1 == BR_MPU_RGDn_WORD2_M0PE(baseAddr, regionNum));
}

/*!
 * @brief Sets the M0 process identifier value--- 1 enable process identifier in region hit evaluation and 0 disable
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param identifierValue Process identifier value
 */
static inline void MPU_HAL_SetM0ProcessIdentifierValue(uint32_t baseAddr, mpu_region_num regionNum, mpu_process_identifier_value identifierValue)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M0PE(baseAddr, regionNum, identifierValue);
}

/*!
 * @brief Gets M1 access permission in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master1 access permission
 */
static inline mpu_supervisor_access_rights MPU_HAL_GetM1SupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (mpu_supervisor_access_rights)(BR_MPU_RGDn_WORD2_M1SM(baseAddr, regionNum)); 
}

/*!
 * @brief Gets M1 access permission in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master1 access permission
 */
static inline mpu_user_access_rights MPU_HAL_GetM1UserAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (mpu_user_access_rights)(BR_MPU_RGDn_WORD2_M1UM(baseAddr, regionNum));
}

/*!
 * @brief Sets M1 access permission in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master1 access permission
 */
static inline void MPU_HAL_SetM1SupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_supervisor_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M1SM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Sets M1 access permission in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master1 access permission
 */
static inline void MPU_HAL_SetM1UserAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_user_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M1UM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Checks whether M1 process identifier enabled in region hit evaluation
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval true m1 process identifier is enabled
 * @retval false m1 process identifier is disabled
 */
static inline bool MPU_HAL_IsM1ProcessIdentifierEnabled(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (1 == BR_MPU_RGDn_WORD2_M1PE(baseAddr, regionNum));
}

/*!
 * @brief Sets the M1 process identifier value--- 1 enable process identifier in region hit evaluation and 0 disable
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param identifierValue Process identifier value
 */
static inline void MPU_HAL_SetM1ProcessIdentifierValue(uint32_t baseAddr, mpu_region_num regionNum, mpu_process_identifier_value identifierValue)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M1PE(baseAddr, regionNum, identifierValue);
}

/*!
 * @brief Gets M2 access permission in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master2 access permission
 */
static inline mpu_supervisor_access_rights MPU_HAL_GetM2SupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (mpu_supervisor_access_rights)(BR_MPU_RGDn_WORD2_M2SM(baseAddr, regionNum)); 
}

/*!
 * @brief Gets M2 access permission in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master2 access permission
 */
static inline mpu_user_access_rights MPU_HAL_GetM2UserAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (mpu_user_access_rights)(BR_MPU_RGDn_WORD2_M2UM(baseAddr, regionNum));
}

/*!
 * @brief Sets M2 access permission in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master2 access permission
 */
static inline void MPU_HAL_SetM2SupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_supervisor_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M2SM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Sets M2 access permission in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master2 access permission
 */
static inline void MPU_HAL_SetM2UserAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_user_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M2UM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Checks whether the M2 process identifier enabled in region hit evaluation
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval true m2 process identifier is enabled
 * @retval false m2 process identifier is disabled
 */

static inline bool MPU_HAL_IsM2ProcessIdentifierEnabled(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (1 == BR_MPU_RGDn_WORD2_M2PE(baseAddr, regionNum));
}

/*!
 * @brief Sets the M2 process identifier value--- 1 enable process identifier in region hit evaluation and 0 disable.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param identifierValue Process identifier value.
 */
static inline void MPU_HAL_SetM2ProcessIdentifierValue(uint32_t baseAddr, mpu_region_num regionNum, mpu_process_identifier_value identifierValue)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M2PE(baseAddr, regionNum, identifierValue);
}

/*!
 * @brief Gets M3 access permission in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master3 access permission
 */
static inline mpu_supervisor_access_rights MPU_HAL_GetM3SupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (mpu_supervisor_access_rights)(BR_MPU_RGDn_WORD2_M3SM(baseAddr, regionNum)); 
}

/*!
 * @brief Gets M3 access permission in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master3 access permission
 */
static inline mpu_user_access_rights MPU_HAL_GetM3UserAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (mpu_user_access_rights)(BR_MPU_RGDn_WORD2_M3UM(baseAddr, regionNum));
}

/*!
 * @brief Sets M3 access permission in supervisor mode.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param accessRights Master3 access permission.
 */
static inline void MPU_HAL_SetM3SupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_supervisor_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M3SM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Sets M3 access permission in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master3 access permission
 */
static inline void MPU_HAL_SetM3UserAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_user_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M3UM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Checks whether the M3 process identifier enabled in region hit evaluation
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval true m3 process identifier is enabled
 * @retval false m3 process identifier is disabled
 */

