jamesmunns/kinetis-rs/platform/hal/mpu/fsl_mpu_hal.h
static inline bool MPU_HAL_IsM3ProcessIdentifierEnabled(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (1 == BR_MPU_RGDn_WORD2_M3PE(baseAddr, regionNum));
}

/*!
 * @brief Sets M3 process identifier value--- 1 enable process identifier in region hit evaluation and 0 disable
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param identifierValue Process identifier value
 */
static inline void MPU_HAL_SetM3ProcessIdentifierValue(uint32_t baseAddr, mpu_region_num regionNum, mpu_process_identifier_value identifierValue)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDn_WORD2_M3PE(baseAddr, regionNum, identifierValue);
}

/*!
 * @brief Gets the M4 access permission.
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessType Access type Read/Write
 * @retval read or write permission
 */
static inline mpu_access_control MPU_HAL_GetM4AccessControl(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    if(kMPUAccessRead == accessType)
    {
        return (mpu_access_control)(BR_MPU_RGDn_WORD2_M4RE(baseAddr, regionNum));
    }
    else
    {
        return (mpu_access_control)(BR_MPU_RGDn_WORD2_M4WE(baseAddr, regionNum));
    }
}

/*!
 * @brief Sets the M4 access permission
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessType Access type Read/Write
 * @param accessControl Access permission
 */
static inline void MPU_HAL_SetM4AccessControl(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType, mpu_access_control accessControl)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    if(kMPUAccessRead == accessType)
    {
       BW_MPU_RGDn_WORD2_M4RE(baseAddr, regionNum, accessControl);
    }
    else
    {
        BW_MPU_RGDn_WORD2_M4WE(baseAddr, regionNum, accessControl);
    }
}

/*!
 * @brief Gets the M5 access permission
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessType Access type Read/Write
 * @retval read or write permission
 */
static inline mpu_access_control MPU_HAL_GetM5AccessControl(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    if(kMPUAccessRead == accessType)
    {
        return (mpu_access_control)(BR_MPU_RGDn_WORD2_M5RE(baseAddr, regionNum));
    }
    else
    {
        return (mpu_access_control)(BR_MPU_RGDn_WORD2_M5WE(baseAddr, regionNum));
    }
}

/*!
 * @brief Sets the M5 access permission
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessType Access type Read/Write
 * @param accessControl Access permission
 */
static inline void MPU_HAL_SetM5AccessControl(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType, mpu_access_control accessControl)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    if(kMPUAccessRead == accessType)
    {
       BW_MPU_RGDn_WORD2_M5RE(baseAddr, regionNum, accessControl);
    }
    else
    {
        BW_MPU_RGDn_WORD2_M5WE(baseAddr, regionNum, accessControl);
    }
}

/*!
 * @brief Gets the M6 access permission
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessType access type Read/Write
 * @retval read or write permission
 */
static inline mpu_access_control MPU_HAL_GetM6AccessControl(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    if(kMPUAccessRead == accessType)
    {
        return (mpu_access_control)(BR_MPU_RGDn_WORD2_M6RE(baseAddr, regionNum));
    }
    else
    {
        return (mpu_access_control)(BR_MPU_RGDn_WORD2_M6WE(baseAddr, regionNum));
    }
}

/*!
 * @brief Sets the M6 access permission
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessType Access type Read/Write
 * @param accessControl Access permission
 */
static inline void MPU_HAL_SetM6AccessControl(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType, mpu_access_control accessControl)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    if(kMPUAccessRead == accessType)
    {
       BW_MPU_RGDn_WORD2_M6RE(baseAddr, regionNum, accessControl);
    }
    else
    {
        BW_MPU_RGDn_WORD2_M6WE(baseAddr, regionNum, accessControl);
    }
}

/*!
 * @brief Gets the M7 access permission
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessType Access type Read/Write
 * @retval read or write permission
 */
static inline mpu_access_control MPU_HAL_GetM7AccessControl(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    if(kMPUAccessRead == accessType)
    {
        return (mpu_access_control)(BR_MPU_RGDn_WORD2_M7RE(baseAddr, regionNum));
    }
    else
    {
        return (mpu_access_control)(BR_MPU_RGDn_WORD2_M7WE(baseAddr, regionNum));
    }
}

/*!
 * @brief Sets the M7 access permission
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessType Access type Read/Write
 * @param accessControl Access permission
 */
static inline void MPU_HAL_SetM7AccessControl(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType, mpu_access_control accessControl)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    if(kMPUAccessRead == accessType)
    {
       BW_MPU_RGDn_WORD2_M7RE(baseAddr, regionNum, accessControl);
    }
    else
    {
        BW_MPU_RGDn_WORD2_M7WE(baseAddr, regionNum, accessControl);
    }
}

/*!
 * @brief Checks whether region is valid
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval true region is valid
 * @retval false region is invalid
 */
static inline bool MPU_HAL_IsRegionValid(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD3_COUNT);
    return (1 == BR_MPU_RGDn_WORD3_VLD(baseAddr, regionNum));
}

/*!
 * @brief Sets  the region valid value
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param validValue Region valid value
 */
static inline void MPU_HAL_SetRegionValidValue(uint32_t baseAddr, mpu_region_num regionNum, mpu_region_valid validValue)
{
    assert(regionNum < HW_MPU_RGDn_WORD3_COUNT);
    BW_MPU_RGDn_WORD3_VLD(baseAddr, regionNum, validValue);
}

/*!
 * @brief Gets the process identifier mask
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval region process identifier mask
 */
static inline uint8_t MPU_HAL_GetProcessIdentifierMask(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD3_COUNT);
    return (BR_MPU_RGDn_WORD3_PIDMASK(baseAddr, regionNum));
}

/*!
 * @brief Sets the process identifier mask
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param processIdentifierMask Process identifier mask value
 */
static inline void MPU_HAL_SetPIDMASK(uint32_t baseAddr, mpu_region_num regionNum, uint8_t processIdentifierMask)
{
    assert(regionNum < HW_MPU_RGDn_WORD3_COUNT);
    BW_MPU_RGDn_WORD3_PIDMASK(baseAddr, regionNum, processIdentifierMask);
}

/*!
 * @brief Gets the process identifier
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval process identifier
 */
static inline uint8_t MPU_HAL_GetProcessIdentifier(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD3_COUNT);
    return (BR_MPU_RGDn_WORD3_PID(baseAddr, regionNum));
}

/*!
 * @brief Sets the process identifier
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param processIdentifier Process identifier
 */
static inline void MPU_HAL_SetProcessIdentifier(uint32_t baseAddr, mpu_region_num regionNum, uint8_t processIdentifier)
{
    assert(regionNum < HW_MPU_RGDn_WORD3_COUNT);
    BW_MPU_RGDn_WORD3_PID(baseAddr, regionNum, processIdentifier);
}

/*!
 * @brief Gets all masters access permission from alternative register
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval all masters access permission
 */
static inline uint32_t MPU_HAL_GetAllMastersAlternateAcessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    return (HW_MPU_RGDAACn_RD(baseAddr, regionNum));
}

/*!
 * @brief Sets all masters access permission through alternative register
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights All masters access permission
 */
static inline void MPU_HAL_SetAllMastersAlternateAccessRights(uint32_t baseAddr, mpu_region_num regionNum, uint32_t accessRights)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    HW_MPU_RGDAACn_WR(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Gets the M0 access rights in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master0 access permission
 */
static inline mpu_supervisor_access_rights MPU_HAL_GetM0AlternateSupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    return (mpu_supervisor_access_rights)(BR_MPU_RGDAACn_M0SM(baseAddr, regionNum));
}

/*!
 * @brief Gets the M0 access rights in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master0 access permission
 */
static inline mpu_user_access_rights MPU_HAL_GetM0AlternateUserAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    return (mpu_user_access_rights)(BR_MPU_RGDAACn_M0UM(baseAddr, regionNum));
}

/*!
 * @brief Sets the M0 access rights in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master0 access permission
 */
static inline void MPU_HAL_SetM0AlternateSupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_supervisor_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    BW_MPU_RGDAACn_M0SM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Sets the M0 access rights in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master0 access permission
 */
static inline void MPU_HAL_SetM0AlternateUserAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_user_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    BW_MPU_RGDAACn_M0UM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Checks whether the M0 process identifier works in region hit evaluation
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval true m0 process identifier is enabled
 * @retval false m0 process identifier is disabled
 */
static inline bool MPU_HAL_IsM0AlternateProcessIdentifierEnabled(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (1 == BR_MPU_RGDAACn_M0PE(baseAddr, regionNum));
}

/*!
 * @brief @brief Sets the M0 process identifier value--- 1 enable process identifier in region hit evaluation and 0 disable
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param identifierValue Process identifier value
 */
static inline void MPU_HAL_SetM0AlternateProcessIdentifierValue(uint32_t baseAddr, mpu_region_num regionNum, mpu_process_identifier_value identifierValue)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDAACn_M0PE(baseAddr, regionNum, identifierValue);
}

/*!
 * @brief Gets M1 access rights in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master1 access permission
 */
static inline mpu_supervisor_access_rights MPU_HAL_GetM1AlternateSupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    return (mpu_supervisor_access_rights)(BR_MPU_RGDAACn_M1SM(baseAddr, regionNum));
}

/*!
 * @brief Gets M1 access rights in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval Master1 access permission
 */
static inline mpu_user_access_rights MPU_HAL_GetM1AlternateUserAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    return (mpu_user_access_rights)(BR_MPU_RGDAACn_M1UM(baseAddr, regionNum));
}

/*!
 * @brief Sets M1 access rights in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master1 access permission
 */
static inline void MPU_HAL_SetM1AlternateSupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_supervisor_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    BW_MPU_RGDAACn_M1SM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Sets M1 access rights in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master1 access permission
 */
static inline void MPU_HAL_SetM1AlternateUserAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_user_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    BW_MPU_RGDAACn_M1UM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Checks whether the M1 process identifier works in region hit evaluation
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval true m1 process identifier is enabled
 * @retval false m1 process identifier is disabled
 */
static inline bool MPU_HAL_IsM1AlternateProcessIdentifierEnabled(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (1 == BR_MPU_RGDAACn_M1PE(baseAddr, regionNum));
}

/*!
 * @brief @brief Sets M1 process identifier value--- 1 enable process identifier in region hit evaluation and 0 disable
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param identifierValue process identifier value
 */
static inline void MPU_HAL_SetM1AlternateProcessIdentifierValue(uint32_t baseAddr, mpu_region_num regionNum, mpu_process_identifier_value identifierValue)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDAACn_M1PE(baseAddr, regionNum, identifierValue);
}

/*!
 * @brief Gets M2 access rights in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval M2 access permission
 */
static inline mpu_supervisor_access_rights MPU_HAL_GetM2AlternateSupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    return (mpu_supervisor_access_rights)(BR_MPU_RGDAACn_M2SM(baseAddr, regionNum));
}

/*!
 * @brief Gets the M2 access rights in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval M2 access permission
 */
static inline mpu_user_access_rights MPU_HAL_GetM2AlternateUserAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    return (mpu_user_access_rights)(BR_MPU_RGDAACn_M2UM(baseAddr, regionNum));
}

/*!
 * @brief Sets  M2 access rights in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights M2 access permission
 */
static inline void MPU_HAL_SetM2AlternateSupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_supervisor_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    BW_MPU_RGDAACn_M2SM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Sets M2 access rights in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights M2 access permission
 */
static inline void MPU_HAL_SetM2AlternateUserAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_user_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    BW_MPU_RGDAACn_M2UM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Checks whether the M2 process identifier works in region hit evaluation
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval true m2 process identifier is enabled
 * @retval false m2 process identifier is disabled
 */
static inline bool MPU_HAL_IsM2AlternateProcessIdentifierEnabled(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (1 == BR_MPU_RGDAACn_M2PE(baseAddr, regionNum));
}

/*!
 * @brief Sets M2 process identifier value--- 1 enable process identifier in region hit evaluation and 0 disable
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param identifierValue process identifier value
 */
static inline void MPU_HAL_SetM2AlternateProcessIdentifierValue(uint32_t baseAddr, mpu_region_num regionNum, mpu_process_identifier_value identifierValue)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDAACn_M2PE(baseAddr, regionNum, identifierValue);
}

/*!
 * @brief Gets  M3 access rights in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval M3 access permission
 */
static inline mpu_supervisor_access_rights MPU_HAL_GetM3AlternateSupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    return (mpu_supervisor_access_rights)(BR_MPU_RGDAACn_M3SM(baseAddr, regionNum));
}

/*!
 * @brief Gets M3 access rights in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @retval M3 access permission
 */
static inline mpu_user_access_rights MPU_HAL_GetM3AlternateUserAccessRights(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    return (mpu_user_access_rights)(BR_MPU_RGDAACn_M3UM(baseAddr, regionNum));
}

/*!
 * @brief Sets M3 access rights in supervisor mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master3 access permission
 */
static inline void MPU_HAL_SetM3AlternateSupervisorAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_supervisor_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    BW_MPU_RGDAACn_M3SM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Sets M3 access rights in user mode
 *
 * @param baseAddr The MPU peripheral base address
 * @param regionNum MPU region number
 * @param accessRights Master3 access permission
 */
static inline void MPU_HAL_SetM3AlternateUserAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_user_access_rights accessRights)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    BW_MPU_RGDAACn_M3UM(baseAddr, regionNum, accessRights);
}

/*!
 * @brief Checks whether the  M3 process identifier works in region hit evaluation.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @retval true m3 process identifier is enabled.
 * @retval false m3 process identifier is disabled.
 */
static inline bool MPU_HAL_IsM3AlternateProcessIdentifierEnabled(uint32_t baseAddr, mpu_region_num regionNum)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    return (1 == BR_MPU_RGDAACn_M3PE(baseAddr, regionNum));
}

/*!
 * @brief Sets M3 process identifier value--- 1 enable process identifier in region hit evaluation and 0 disable.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param identifierValue process identifier value.
 */
static inline void MPU_HAL_SetM3AlternateProcessIdentifierValue(uint32_t baseAddr, mpu_region_num regionNum, mpu_process_identifier_value identifierValue)
{
    assert(regionNum < HW_MPU_RGDn_WORD2_COUNT);
    BW_MPU_RGDAACn_M3PE(baseAddr, regionNum, identifierValue);
}

/*!
 * @brief Gets M4 access permission from alternate register.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param accessType Access type Read/Write.
 * @retval read or write permission.
 */
static inline mpu_access_control MPU_HAL_GetM4AlternateAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    if(kMPUAccessRead == accessType)
    {
        return (mpu_access_control)(BR_MPU_RGDAACn_M4RE(baseAddr, regionNum));
    }
    else
    {
        return (mpu_access_control)(BR_MPU_RGDAACn_M4WE(baseAddr, regionNum));
    }
}

/*!
 * @brief Sets M4 access permission through alternate register.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param accessType Access type Read/Write.
 * @param accessControl Access permission.
 */
static inline void MPU_HAL_SetM4AlternateAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType, mpu_access_control accessControl)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    if(kMPUAccessRead == accessType)
    {
        BW_MPU_RGDAACn_M4RE(baseAddr, regionNum, accessControl);
    }
    else
    {
        BW_MPU_RGDAACn_M4WE(baseAddr, regionNum, accessControl);
    }
}

/*!
 * @brief Gets M5 access permission from alternate register.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param accessType Access type Read/Write.
 * @retval read or write permission.
 */
static inline mpu_access_control MPU_HAL_GetM5AlternateAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    if(kMPUAccessRead == accessType)
    {
        return (mpu_access_control)(BR_MPU_RGDAACn_M5RE(baseAddr, regionNum));
    }
    else
    {
        return (mpu_access_control)(BR_MPU_RGDAACn_M5WE(baseAddr, regionNum));
    }
}

/*!
 * @brief Sets M5 access permission through alternate register.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param accessType Access type Read/Write.
 * @param accessControl Master5 Access permission.
 */
static inline void MPU_HAL_SetM5AlternateAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType, mpu_access_control accessControl)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    if(kMPUAccessRead == accessType)
    {
        BW_MPU_RGDAACn_M5RE(baseAddr, regionNum, accessControl);
    }
    else
    {
        BW_MPU_RGDAACn_M5WE(baseAddr, regionNum, accessControl);
    }
}

