jamesmunns/kinetis-rs/platform/hal/mpu/fsl_mpu_hal.h
/*!
 * @brief Gets M6 access permission from alternate register.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param accessType Access type Read/Write.
 * @retval read or write permission.
 */
static inline mpu_access_control MPU_HAL_GetM6AlternateAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    if(kMPUAccessRead == accessType)
    {
        return (mpu_access_control)(BR_MPU_RGDAACn_M6RE(baseAddr, regionNum));
    }
    else
    {
        return (mpu_access_control)(BR_MPU_RGDAACn_M6WE(baseAddr, regionNum));
    }
}

/*!
 * @brief Sets M6 access permission through alternate register.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param accessType Access type Read/Write.
 * @param accessControl Master6 access permission.
 */
static inline void MPU_HAL_SetM6AlternateAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType, mpu_access_control accessControl)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    if(kMPUAccessRead == accessType)
    {
        BW_MPU_RGDAACn_M6RE(baseAddr, regionNum, accessControl);
    }
    else
    {
        BW_MPU_RGDAACn_M6WE(baseAddr, regionNum, accessControl);
    }
}

/*!
 * @brief Gets M7 access permission from alternate register.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param accessType Access type Read/Write.
 * @retval read or write permission.
 */
static inline mpu_access_control MPU_HAL_GetM7AlternateAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    if(kMPUAccessRead == accessType)
    {
        return (mpu_access_control)(BR_MPU_RGDAACn_M7RE(baseAddr, regionNum));
    }
    else
    {
        return (mpu_access_control)(BR_MPU_RGDAACn_M7WE(baseAddr, regionNum));
    }
}

/*!
 * @brief Sets M7 access permission through alternate register.
 *
 * @param baseAddr The MPU peripheral base address.
 * @param regionNum MPU region number.
 * @param accessType Access type Read/Write.
 * @param accessControl Master7 access permission.
 */
static inline void MPU_HAL_SetM7AlternateAccessRights(uint32_t baseAddr, mpu_region_num regionNum, mpu_access_type accessType, mpu_access_control accessControl)
{
    assert(regionNum < HW_MPU_RGDAACn_COUNT);
    if(kMPUAccessRead == accessType)
    {
        BW_MPU_RGDAACn_M7RE(baseAddr, regionNum, accessControl);
    }
    else
    {
        BW_MPU_RGDAACn_M7WE(baseAddr, regionNum, accessControl);
    }
}

/*!
 * @brief Initializes the MPU module.
 *
 * @param baseAddr The MPU peripheral base address.
 */
void MPU_HAL_Init(uint32_t baseAddr);

/*@}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_MPU_HAL_H__*/
/*******************************************************************************
 * EOF
 *******************************************************************************/

